In [1]:
print('Hello world from jupyter notebook')

Hello world from jupyter notebook

In [3]:
import pandas as pd

In [4]:
df = pd.read_csv('./archive/unigram_freq.csv', index_col = 'word')

In [5]:
df.head()

            count
word
the   23135851162
of    13151942776
and   12997637966
to    12136980858
a      9081174698

In [6]:
#total elements the data set has
#method-1
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 333333 entries, the to golgw
Data columns (total 1 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   count   333333 non-null  int64
dtypes: int64(1)
memory usage: 5.1+ MB

In [7]:
#method 2
df.shape

(333333, 1)

In [8]:
#what is the count of the word "the"
df.loc["the"]

count    23135851162
Name: the, dtype: int64

In [9]:
# df.loc[] accepts 2 parameters , one is index selection and the other is columm
# df.loc[INDEX , COLUMNS]
df.loc["for", "count"]

5933321709

In [10]:
#The highest possible count of a word
df['count'].max()

23135851162

In [11]:
df.max()

count    23135851162
dtype: int64

In [12]:
df.describe()

              count
count  3.333330e+05
mean   1.764374e+06
std    6.629987e+07
min    1.271100e+04
25%    2.122400e+04
50%    4.151900e+04
75%    1.365760e+05
max    2.313585e+10

In [13]:
#what is the count of the words : 'and' , 'or' , 'the'
#with df.loc[] we can pass multiple indeces as a list

df.loc[["and" , "or" , "the"]]

            count
word
and   12997637966
or     2590739907
the   23135851162

In [14]:
df.loc[["and" , "or" , "a"], "count"]

word
and    12997637966
or      2590739907
a       9081174698
Name: count, dtype: int64

In [15]:
#find the only word with a count of "2590739907"
#method 1

df.sort_values(by=['count'], ascending = False)

             count
word
the    23135851162
of     13151942776
and    12997637966
to     12136980858
a       9081174698
...            ...
ooahl        12711
omai         12711
okgol        12711
okgle        12711
golgw        12711

[333333 rows x 1 columns]

In [16]:
#method 2 
#conditional selection

df.loc[df['count'] == 2590739907]

           count
word
or    2590739907

In [22]:
# df['count']  returns a boolean array

(df['count'] == 2590739907)

word
the        False
of         False
and        False
to         False
a          False
           ...
gooek      False
gooddg     False
gooblle    False
gollgo     False
golgw      False
Name: count, Length: 333333, dtype: bool

In [28]:
#in reality these boolean arrays are just 1's and 0's

In [17]:
#what is the most common count
df['count'].describe()

count    3.333330e+05
mean     1.764374e+06
std      6.629987e+07
min      1.271100e+04
25%      2.122400e+04
50%      4.151900e+04
75%      1.365760e+05
max      2.313585e+10
Name: count, dtype: float64

In [18]:
df['count'].mode()

0    12711
Name: count, dtype: int64

In [19]:
df['count'].value_counts().head()

count
12711    152
21536    146
12712    143
21534    119
12714    115
Name: count, dtype: int64

In [20]:
#get the first 10 words which have a word count of 12711
df.loc[df['count'] == 12711].head(10)

                   count
word
yyt                12711
yuaoo              12711
yoooog             12711
yoohl              12711
yooal              12711
yhaoop             12711
yaoob              12711
wwwsexdrugs        12711
wwwphotogalleries  12711
wwwlips            12711

In [33]:
#get random 10 words having word count of 12711

df.loc[df['count'] == 12711].sample(10)

                   count
word
googook            12711
iogol              12711
yooal              12711
gopag              12711
wwwphotogalleries  12711
justforsex         12711
hoogga             12711
googgol            12711
oohool             12711
ofoge              12711

In [21]:
((df.loc[df['count'] == 12711]).head(1))

      count
word
yyt   12711

In [23]:
#creating a new column "ratio"
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 333333 entries, the to golgw
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   count   333333 non-null  int64
 1   ratio   333333 non-null  float64
dtypes: float64(1), int64(1)
memory usage: 15.7+ MB

In [24]:
df['index'] = df.index

In [25]:
df.head()

            count          ratio index
word
the   23135851162  832494.374510   the
of    13151942776  473244.675470    of
and   12997637966  467692.345220   and
to    12136980858  436723.430535    to
a      9081174698  326766.748156     a

In [26]:
df.pop('ratio')

word
the        832494.374510
of         473244.675470
and        467692.345220
to         436723.430535
a          326766.748156
               ...
gooek           0.457378
gooddg          0.457378
gooblle         0.457378
gollgo          0.457378
golgw           0.457378
Name: ratio, Length: 333333, dtype: float64

In [27]:
df.head(10)

            count index
word
the   23135851162   the
of    13151942776    of
and   12997637966   and
to    12136980858    to
a      9081174698     a
in     8469404971    in
for    5933321709   for
is     4705743816    is
on     3750423199    on
that   3400031103  that

In [28]:
df["index"] = df.index

In [29]:
df.head(10)

            count index
word
the   23135851162   the
of    13151942776    of
and   12997637966   and
to    12136980858    to
a      9081174698     a
in     8469404971    in
for    5933321709   for
is     4705743816    is
on     3750423199    on
that   3400031103  that

In [30]:
data_type = df['index'].dtypes

In [32]:
print(data_type)

object

In [33]:
df.pop('index')

word
the            the
of              of
and            and
to              to
a                a
            ...
gooek        gooek
gooddg      gooddg
gooblle    gooblle
gollgo      gollgo
golgw        golgw
Name: index, Length: 333333, dtype: object

In [34]:
df.head(20)

            count
word
the   23135851162
of    13151942776
and   12997637966
to    12136980858
a      9081174698
in     8469404971
for    5933321709
is     4705743816
on     3750423199
that   3400031103
by     3350048871
this   3228469771
with   3183110675
i      3086225277
you    2996181025
it     2813163874
not    2633487141
or     2590739907
be     2398724162
are    2393614870

In [35]:
#what is the word having the highest number of count
df.sort_values(by='count', ascending=False).head(20)

            count
word
the   23135851162
of    13151942776
and   12997637966
to    12136980858
a      9081174698
in     8469404971
for    5933321709
is     4705743816
on     3750423199
that   3400031103
by     3350048871
this   3228469771
with   3183110675
i      3086225277
you    2996181025
it     2813163874
not    2633487141
or     2590739907
be     2398724162
are    2393614870

In [38]:
df.loc[df['count'] == 12451].shape

(0, 1)

In [40]:
df.query("count == 17281")

                   count
word
phillycarsearch    17281
naib               17281
moneglia           17281
incompressibility  17281
faily              17281
duralite           17281
drugz              17281
colegial           17281
balistreri         17281

In [43]:
df['count'].describe()

count    3.333330e+05
mean     1.764374e+06
std      6.629987e+07
min      1.271100e+04
25%      2.122400e+04
50%      4.151900e+04
75%      1.365760e+05
max      2.313585e+10
Name: count, dtype: float64

In [45]:
# find all the words with count > avg count
mean_count = df['count'].mean()
print(mean_count)

1764374.424935425

In [46]:
df.query(" count > @mean_count")

                    count
word
the           23135851162
of            13151942776
and           12997637966
to            12136980858
a              9081174698
...                   ...
disagreement      1764697
hhs               1764661
strands           1764600
tyrosine          1764516
sicily            1764441

[18904 rows x 1 columns]